data-asplos/themis-vm/lighttpd-100.txt
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.25ms    1.37ms  13.63ms   93.31%
    Req/Sec     5.29k   266.82    11.17k    71.25%
  7585586 requests in 2.00m, 2.23GB read
Requests/sec:  63169.74
Transfer/sec:     18.99MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.41ms    1.44ms  18.37ms   90.88%
    Req/Sec     5.17k   342.58     9.47k    76.56%
  7406369 requests in 2.00m, 2.17GB read
Requests/sec:  61683.98
Transfer/sec:     18.54MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.52ms    1.46ms  24.67ms   90.79%
    Req/Sec     5.08k   289.97     9.40k    82.98%
  7277455 requests in 2.00m, 2.14GB read
Requests/sec:  60609.79
Transfer/sec:     18.22MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.32ms    1.54ms  21.14ms   84.18%
    Req/Sec     5.24k   642.02    23.09k    86.32%
  7510147 requests in 2.00m, 2.20GB read
Requests/sec:  62532.12
Transfer/sec:     18.80MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.24ms    1.40ms  22.99ms   93.16%
    Req/Sec     5.31k   340.84    18.80k    72.96%
  7605467 requests in 2.00m, 2.23GB read
Requests/sec:  63326.72
Transfer/sec:     19.04MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.15ms    1.36ms  13.85ms   93.37%
    Req/Sec     5.38k   265.41    10.60k    73.49%
  7710051 requests in 2.00m, 2.26GB read
Requests/sec:  64218.62
Transfer/sec:     19.30MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.17ms    1.38ms  24.60ms   93.28%
    Req/Sec     5.36k   327.55    25.65k    79.31%
  7684481 requests in 2.00m, 2.26GB read
Requests/sec:  63984.00
Transfer/sec:     19.23MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.10ms    1.35ms  13.68ms   93.27%
    Req/Sec     5.42k   246.53    12.61k    80.05%
  7770957 requests in 2.00m, 2.28GB read
Requests/sec:  64719.36
Transfer/sec:     19.45MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.29ms    1.39ms  25.75ms   93.21%
    Req/Sec     5.26k   336.80    22.12k    78.33%
  7537979 requests in 2.00m, 2.21GB read
Requests/sec:  62764.62
Transfer/sec:     18.87MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.33ms    1.38ms  14.05ms   93.47%
    Req/Sec     5.23k   237.87    11.53k    78.51%
  7496232 requests in 2.00m, 2.20GB read
Requests/sec:  62436.08
Transfer/sec:     18.77MB