data-asplos/themis-vm/lighttpd-1M.txt
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76s   238.04ms   2.00s    86.51%
    Req/Sec    11.59      7.66    60.00     67.45%
  13155 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 16, write 0, timeout 12725
Requests/sec:    109.54
Transfer/sec:    111.26MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78s   199.70ms   2.00s    77.98%
    Req/Sec    11.53      7.47    60.00     67.20%
  13166 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 20, write 0, timeout 12780
Requests/sec:    109.63
Transfer/sec:    111.26MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.73s   297.82ms   2.00s    89.64%
    Req/Sec    11.53      7.56    60.00     67.44%
  13125 requests in 2.00m, 13.01GB read
  Socket errors: connect 0, read 31, write 0, timeout 12575
Requests/sec:    109.29
Transfer/sec:    110.91MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78s   210.94ms   2.00s    82.98%
    Req/Sec    11.54      7.57    60.00     67.38%
  13170 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 10, write 0, timeout 12788
Requests/sec:    109.66
Transfer/sec:    111.26MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.80s   194.91ms   2.00s    82.60%
    Req/Sec    11.58      7.62    70.00     66.77%
  13169 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 16, write 0, timeout 12784
Requests/sec:    109.65
Transfer/sec:    111.23MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.80s   170.91ms   2.00s    72.29%
    Req/Sec    11.60      7.60    70.00     66.52%
  13161 requests in 2.00m, 13.04GB read
  Socket errors: connect 0, read 13, write 0, timeout 12811
Requests/sec:    109.64
Transfer/sec:    111.27MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.73s   258.15ms   2.00s    81.42%
    Req/Sec    11.63      7.73    70.00     66.89%
  13172 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 17, write 0, timeout 12596
Requests/sec:    109.69
Transfer/sec:    111.28MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.73s   253.44ms   2.00s    81.71%
    Req/Sec    11.72      7.87    60.00     66.33%
  13159 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 11, write 0, timeout 12421
Requests/sec:    109.58
Transfer/sec:    111.28MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78s   227.45ms   2.00s    87.90%
    Req/Sec    11.54      7.57    60.00     67.08%
  13160 requests in 2.00m, 13.04GB read
  Socket errors: connect 0, read 20, write 0, timeout 12755
Requests/sec:    109.64
Transfer/sec:    111.27MB
Running 2m test @ http://128.178.116.199:6380/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77s   238.01ms   2.00s    87.17%
    Req/Sec    11.63      7.69    60.00     66.55%
  13165 requests in 2.00m, 13.05GB read
  Socket errors: connect 0, read 20, write 0, timeout 12752
Requests/sec:    109.62
Transfer/sec:    111.26MB